# Machine Learning : Predictive Model for Titanic Survival rate

In [1]:
import pandas as pd
df = pd.read_csv('C:\\Users\\user\\Documents\\PY ML\\titanic data set\\titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis= 'columns',inplace = True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [64]:
inputs = df.drop('Survived',axis = 'columns')
Target = df.Survived

In [65]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [66]:
inputs.Sex = inputs.Sex.map({'male':1,'female': 2})

inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

In [67]:
inputs.rename(columns ={'Sex':'gender'},inplace= True)
inputs.head()

   Pclass  gender   Age     Fare
0       3       1  22.0   7.2500
1       1       2  38.0  71.2833
2       3       2  26.0   7.9250
3       1       2  35.0  53.1000
4       3       1  35.0   8.0500

In [69]:
inputs.Fare = inputs.Fare.round()
inputs.head()

   Pclass  gender   Age  Fare
0       3       1  22.0   7.0
1       1       2  38.0  71.0
2       3       2  26.0   8.0
3       1       2  35.0  53.0
4       3       1  35.0   8.0

In [70]:
Target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [71]:
inputs.Age = inputs.Age.round()

In [72]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [73]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass  gender   Age  Fare
0       3       1  22.0   7.0
1       1       2  38.0  71.0
2       3       2  26.0   8.0
3       1       2  35.0  53.0
4       3       1  35.0   8.0

In [74]:
from sklearn.model_selection import train_test_split

In [75]:
X_train,X_test,Y_train,Y_test = train_test_split(inputs,Target,test_size=0.2)

In [76]:
len(X_train)

712

In [77]:
len(X_test)

179

In [78]:
from sklearn import tree

In [79]:
model = tree.DecisionTreeClassifier()

In [80]:
model.fit(X_train,Y_train)

DecisionTreeClassifier()

In [81]:
model.score(X_test,Y_test)

0.7821229050279329

In [86]:
Prediction_of_Survival = model.predict([[1,2,38.0,71.0]])

C:\Users\user\Documents\Anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

In [87]:
if Prediction_of_Survival == 1:
    print("Survived")
else:
    print("Didn't Survived")

Survived

In [89]:
Prediction_of_Survival = model.predict([[1,2,35.0,53.0]])
if Prediction_of_Survival == 1:
    print("Survived")
else:
    print("Didn't Survived")

Survived

C:\Users\user\Documents\Anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(